[
    {
        "Name": "Kobold Spearman",
        "Description": "This small, reptilian creature is armed with a primitive spear, its red scales blending seamlessly with the fiery terrains it often inhabits. Though small in stature, the Kobold Spearman is a nimble and tenacious fighter, known for striking swiftly and retreating to safety. Its yellow, slitted eyes gleam with cunning, and it relies on numbers and teamwork to overwhelm its opponents.",
        "Type1": "Earth",
        "Type2": "None",
        "HP": 90,
        "Strength": 75,
        "Endurance": 70,
        "Intelligence": 50,
        "Fortitude": 60,
        "Agility": 85,
        "Total Stats": 430,
        "EXP Yield": 45,
        "Growth Rate": "MediumFast",
        "Recruit Rate": 220
    },
    {
        "Name": "Kobold Swordsman",
        "Description": "The Kobold Swordsman is a cunning and agile warrior, favoring quick, slashing attacks with its curved sword and round shield. Its red scales shimmer in the heat, and its lightweight armor allows for swift movement in battle. Always eager to fight, this creature compensates for its small size with relentless assaults and tactical strikes, using its shield to deflect blows while looking for an opening.",
        "Type1": "Earth",
        "Type2": "None",
        "HP": 95,
        "Strength": 80,
        "Endurance": 65,
        "Intelligence": 50,
        "Fortitude": 55,
        "Agility": 90,
        "Total Stats": 435,
        "EXP Yield": 48,
        "Growth Rate": "MediumFast",
        "Recruit Rate": 215
    },
    {
        "Name": "Kobold Caster",
        "Description": "Draped in a brown robe and wielding a simple wooden staff with a glowing gem, the Kobold Caster focuses on magical arts rather than brute force. Its yellow eyes shimmer with intelligence, and though it lacks physical strength, it compensates with powerful spells that manipulate the elements. Often found chanting incantations, this kobold is a key support unit in kobold tribes, providing healing or offensive spells from afar.",
        "Type1": "Mind",
        "Type2": "Earth",
        "HP": 80,
        "Strength": 40,
        "Endurance": 55,
        "Intelligence": 95,
        "Fortitude": 60,
        "Agility": 70,
        "Total Stats": 400,
        "EXP Yield": 50,
        "Growth Rate": "MediumFast",
        "Recruit Rate": 225,
        "Rarity": "Common"
    },
    {
        "Name": "Naga Spearman",
        "Description": "A serpentine warrior with green scales and a coiled body, the Naga Spearman brandishes a spear tipped with a sharp blade. Its red eyes gleam with malice as it slithers across the battlefield, striking swiftly with its weapon. Though not the most powerful of the naga, it relies on agility and precision to wear down its foes. Its spear is often adorned with symbols of its tribe, and the Naga Spearman is known for ambush tactics, striking from the undergrowth.",
        "Type1": "Water",
        "Type2": "Earth",
        "HP": 85,
        "Strength": 80,
        "Endurance": 70,
        "Intelligence": 50,
        "Fortitude": 65,
        "Agility": 80,
        "Total Stats": 430,
        "EXP Yield": 52,
        "Growth Rate": "MediumFast",
        "Recruit Rate": 210,
        "Rarity": "Common"
    },
    {
        "Name": "Naga Tridentbearer",
        "Description": "With long purple hair and a fierce demeanor, the Naga Tridentbearer wields a trident with lethal precision. Her green, scaly body is well-suited for aquatic combat, and she is often seen leading smaller naga into battle. The trident she wields is a symbol of authority within naga tribes, and she uses it to unleash powerful thrusting attacks, enhanced by her natural affinity with water. Her red eyes glow ominously, reflecting the battle prowess she has honed over countless conflicts.",
        "Type1": "Water",
        "Type2": "Earth",
        "HP": 95,
        "Strength": 90,
        "Endurance": 80,
        "Intelligence": 60,
        "Fortitude": 75,
        "Agility": 80,
        "Total Stats": 480,
        "EXP Yield": 70,
        "Growth Rate": "MediumFast",
        "Recruit Rate": 150,
        "Rarity": "Uncommon"
    },
    {
        "Name": "Naga Bladesworn",
        "Description": "A swift and deadly combatant, the Naga Bladesworn is armed with two curved blades that gleam in the dim light. Its muscular, serpentine body coils tightly as it strikes with incredible speed and precision. The Bladesworn is known for its agility and quick reflexes, making it a formidable duelist. With its keen sense of battle, it often dodges incoming attacks, countering with a flurry of rapid strikes. This naga is less armored than its kin, relying entirely on its offensive prowess to dominate the battlefield.",
        "Type1": "Water",
        "Type2": "None",
        "HP": 85,
        "Strength": 90,
        "Endurance": 60,
        "Intelligence": 50,
        "Fortitude": 55,
        "Agility": 95,
        "Total Stats": 435,
        "EXP Yield": 53,
        "Growth Rate": "MediumFast",
        "Recruit Rate": 215,
        "Rarity": "Common"
    },
    {
        "Name": "Naga Archer",
        "Description": "The Naga Archer is a skilled marksman, utilizing a bow crafted from sturdy jungle wood. With its muscular serpentine body coiled tightly, it patiently waits for the perfect moment to release its arrows with deadly precision. Its red eyes scan the horizon for any signs of movement, allowing it to strike from a distance with great accuracy. Unlike other naga, the Archer prefers to stay at range, relying on its sharp eyes and quick reflexes to keep enemies at bay.",
        "Type1": "Water",
        "Type2": "None",
        "HP": 80,
        "Strength": 75,
        "Endurance": 60,
        "Intelligence": 55,
        "Fortitude": 65,
        "Agility": 90,
        "Total Stats": 425,
        "EXP Yield": 50,
        "Growth Rate": "MediumFast",
        "Recruit Rate": 220,
        "Rarity": "Common"
    },
    {
        "Name": "Naga Reaver",
        "Description": "Wielding a massive two-handed axe, the Naga Reaver is a fearsome brute on the battlefield. With its strong, green-scaled body, it swings its weapon with crushing force, capable of cleaving through defenses with ease. Though not the fastest of its kin, the Reaver’s sheer strength makes it a dangerous opponent in close combat. Its red eyes burn with intensity as it relentlessly advances, leaving destruction in its wake.",
        "Type1": "Water",
        "Type2": "Earth",
        "HP": 100,
        "Strength": 95,
        "Endurance": 85,
        "Intelligence": 45,
        "Fortitude": 70,
        "Agility": 60,
        "Total Stats": 455,
        "EXP Yield": 58,
        "Growth Rate": "MediumFast",
        "Recruit Rate": 200,
        "Rarity": "Common"
    }
]