[
    {
        "Name": "Kobold Spearman",
        "Description": "This small, reptilian creature is armed with a primitive spear, its red scales blending seamlessly with the fiery terrains it often inhabits. Though small in stature, the Kobold Spearman is a nimble and tenacious fighter, known for striking swiftly and retreating to safety. Its yellow, slitted eyes gleam with cunning, and it relies on numbers and teamwork to overwhelm its opponents.",
        "Type1": "Earth",
        "Type2": null,
        "HP": 90,
        "Strength": 75,
        "Endurance": 70,
        "Intelligence": 50,
        "Fortitude": 50,
        "Agility": 85,
        "Total Stats": 420,
        "EXP Yield": 45,
        "Growth Rate": "MediumFast",
        "Recruit Rate": 220,
        "Rarity": "Common"
    },
    {
        "Name": "Kobold Swordsman",
        "Description": "The Kobold Swordsman is a cunning and agile warrior, favoring quick, slashing attacks with its curved sword and round shield. Its red scales shimmer in the heat, and its lightweight armor allows for swift movement in battle. Always eager to fight, this creature compensates for its small size with relentless assaults and tactical strikes, using its shield to deflect blows while looking for an opening.",
        "Type1": "Earth",
        "Type2": null,
        "HP": 95,
        "Strength": 80,
        "Endurance": 75,
        "Intelligence": 50,
        "Fortitude": 50,
        "Agility": 70,
        "Total Stats": 420,
        "EXP Yield": 45,
        "Growth Rate": "MediumFast",
        "Recruit Rate": 220,
        "Rarity": "Common"
    },
    {
        "Name": "Kobold Caster",
        "Description": "Draped in a brown robe and wielding a simple wooden staff with a glowing gem, the Kobold Caster focuses on magical arts rather than brute force. Its yellow eyes shimmer with intelligence, and though it lacks physical strength, it compensates with powerful spells that manipulate the elements. Often found chanting incantations, this kobold is a key support unit in kobold tribes, providing healing or offensive spells from afar.",
        "Type1": "Mind",
        "Type2": "Earth",
        "HP": 85,
        "Strength": 40,
        "Endurance": 55,
        "Intelligence": 95,
        "Fortitude": 80,
        "Agility": 65,
        "Total Stats": 420,
        "EXP Yield": 45,
        "Growth Rate": "MediumFast",
        "Recruit Rate": 220,
        "Rarity": "Common"
    }
]